{"data":{"allMarkdownRemark":{"edges":[{"node":{"excerpt":"Cette carte de Toulouse a été créée à partir de données provenant de OpenStreetMap ; la zone affichée se situe à Toulouse et ses environs. Affichage des zones d'occupation des sols Je choisis de simplifier la représentation de l'occupation des sols en grands groupes : residentiel, commercial, industriel, naturel : Je crée des textures sous GIMP que j'applique aux couches concernées. Les bords sont…","id":"15c7f0db-2f6a-5d37-bed3-b920443a30c0","fields":{"slug":"/blog/generation-procedurale-de-tuiles-3/"},"frontmatter":{"title":"Dessiner une ville à la main avec TileMill (3 – Occupation des sols et cours d'eau)","templateKey":"blog-post","date":"March 03, 2017"}}},{"node":{"excerpt":"Depuis quelques années des initiatives internationales se mettent en place pour collecter et partager des données relatives à la biodiversité. Des projets comme celui du GBIF ou d'IDigBio permettent désormais de consulter et de récupérer des ensembles de données correspondant à des observations pour un territoire, une période ou une espèce spécifique. La conception d'interfaces facilitant la…","id":"ef0bf832-dcca-5556-ae4a-3aec20c9d1d4","fields":{"slug":"/blog/clustering-pour-lanalyse-de-la-biodiversite/"},"frontmatter":{"title":"Clustering pour l'analyse de la biodiversité","templateKey":"blog-post","date":"March 03, 2017"}}},{"node":{"excerpt":"Dans le cadre du développement d'une application, nous avons du mettre un place un module de comparaison d'images deux à deux. Le principe du comparateur est simple et efficace : un pointeur simultané permet de se situer sur les deux images à la fois, accompagné d'un zoom (comme dans l'application  VuDuCiel ). Pourtant, quelque chose nous dérange, du moins ne nous satisfait pas dans ce module. Les…","id":"b704c9a3-1f74-5e73-8159-fa5d54c34c5c","fields":{"slug":"/blog/redressement-dimages/"},"frontmatter":{"title":"Utilisation de la vision par ordinateur pour redresser des images","templateKey":"blog-post","date":"March 03, 2017"}}},{"node":{"excerpt":"Cet article est le premier d'une (longue ?) série sur notre utilisation du machine learning pour nos clients. La première étape d'un projet de machine learning est la récupération et l'import des données. Malheureusement, dans des projets réels, nous obtenons régulièrement des fichiers incomplets, comportant des erreurs… Il est donc crucial, avant même de travailler sur des visualisations ou des…","id":"72bae131-7fd0-57b1-9944-e00affdaa646","fields":{"slug":"/blog/machine-learning-import-donnees/"},"frontmatter":{"title":"Machine Learning - classer automatiquement vos données à l'import","templateKey":"blog-post","date":"March 03, 2017"}}},{"node":{"excerpt":"Cette carte de Toulouse a été créée à partir de données provenant de OpenStreetMap ; la zone affichée se situe à Toulouse et ses environs. La donne En m'imaginant comment je dessinerais moi-même cette carte, à l'échelle des quartiers, je me suis dit que j'aurais travaillé en différentes étapes. Tout d'abord une ébauche rapide au crayon des bâtiments, avec des formes plutôt arrondies (utilisant le…","id":"11175456-5f3d-54a4-9813-01d68a92fb39","fields":{"slug":"/blog/generation-procedurale-de-tuiles-2/"},"frontmatter":{"title":"Dessiner une ville à la main avec TileMill (2 - Découper 340 000 polygones)","templateKey":"blog-post","date":"February 04, 2017"}}},{"node":{"excerpt":"Cette  carte de Toulouse  a été créée à partir de données provenant de OpenStreetMap ; la zone affichée se situe à Toulouse et ses environs. La réalisation est faite sans modifier les données d'origine, afin de pouvoir appliquer ces styles à d'autres emprises avec un minimum d'interventions techniques. La majeure partie du travail résidait dans la définition d'un affichage « imparfait » des…","id":"f515a515-9066-51d4-8f73-e53e8d81acde","fields":{"slug":"/blog/generation-procedurale-de-tuiles-1/"},"frontmatter":{"title":"Dessiner une ville à la main avec TileMill (1 - Les bâtiments)","templateKey":"blog-post","date":"December 17, 2016"}}}]}}}